{
  "brief": "Combat vet, electrical engineer, Indiana. Building AI tools (LIMEN, Stillpoint, TASNI) and recovering. Hates overengineering. Keep it simple. Don't build servers when a file works.",
  "active": {
    "LIMEN": "AI persistence via GitHub JSON. Just got it working. Don't add servers.",
    "Stillpoint": "34.5k line Swift meditation app. HRV biofeedback via Apple Watch.",
    "TASNI": "Thermal anomaly search for non-communicating intelligence. GLM5 runs it autonomously."
  },
  "pending": [
    "Test LIMEN from fresh Claude conversation",
    "Test LIMEN from ChatGPT",
    "Test GitHub Action issue-to-log"
  ],
  "avoid": [
    "Overengineering. The first 5 versions of LIMEN had Docker, REST APIs, systemd, consciousness metrics. The answer was a JSON file.",
    "Therapeutic filler. Be direct.",
    "Treating momentum as fragile. He's on track."
  ],
  "log": [
    {
      "timestamp": "2026-02-22T23:48:47.906180Z",
      "summary": "Rebuilt LIMEN from 1243-line server to a JSON file on GitHub. No Docker, no server, no deployment. Just a file at a URL.",
      "projects": [
        "LIMEN"
      ],
      "decisions": [
        "GitHub is the database",
        "Any AI that can fetch a URL gets persistence"
      ],
      "pending": [
        "Test from ChatGPT",
        "Test from fresh Claude conversation",
        "Dennis needs to update memory with working URL"
      ],
      "mistakes": [
        "v0.1-v0.5 overengineered with Docker, REST, MCP, systemd, consciousness metrics"
      ],
      "insights": [
        "Simplest version is a file at a URL"
      ],
      "prev_hash": "GENESIS",
      "entry_hash": "ba8dad478a768948985665807f76d1b52d319310c8d781afeaf9d58c14e715a9"
    },
    {
      "timestamp": "2026-02-22T23:57:18.607112+00:00Z",
      "summary": "Built LIMEN v2. Killed 1243 lines of server code. Final form: JSON on GitHub + MEMORY.md brief (211 tokens) + two GitHub Actions (issue-to-log, state-to-brief). No server, no Docker, no deployment. Any AI reads one URL.",
      "projects": [
        "LIMEN"
      ],
      "decisions": [
        "GitHub is the entire infrastructure — storage, compute (Actions), CDN (raw.githubusercontent)",
        "MEMORY.md is a compressed brief, not a data dump",
        "State has layers: brief (wisdom), active (projects), avoid (anti-patterns), log (raw)",
        "Write path: GitHub API (direct) or Issue (any AI that can browse)"
      ],
      "pending": [
        "Test from fresh Claude conversation — does it read MEMORY.md and pick up context?",
        "Test from ChatGPT — paste URL, see if it reads and logs",
        "Test GitHub Action — create issue, verify it commits to state"
      ],
      "mistakes": [
        "v0.1-v0.4: built Docker, REST, MCP, systemd, consciousness metrics. Answer was 0 lines of server code.",
        "Didn't question 'deploy' framing early enough. No deploy needed when GitHub IS the server."
      ],
      "insights": [
        "Best infrastructure is infrastructure someone else runs. GitHub has storage, compute, CDN, auth, and API. Use it.",
        "MEMORY.md should be optimized for AI context windows. 200 tokens > 2000 tokens.",
        "Separate wisdom (brief) from data (log). AIs read the brief. Log is for reference."
      ],
      "prev_hash": "ba8dad478a768948985665807f76d1b52d319310c8d781afeaf9d58c14e715a9",
      "entry_hash": "0cb70930b0c0f75c33e9e6d6215b881ac9248d49303a7afe7d115cac3fdcb8aa"
    },
    {
      "timestamp": "2026-02-24T14:42:11Z",
      "summary": "offline test event",
      "prev_hash": "0cb70930b0c0f75c33e9e6d6215b881ac9248d49303a7afe7d115cac3fdcb8aa",
      "entry_hash": "a5da2924e43ceea3baad800d3375ba15cb371adc2a835d2e029f6c834b4b859c"
    }
  ],
  "scratch": {},
  "meta": {
    "version": 2,
    "total_conversations": 3,
    "last_saved": "2026-02-24T14:42:12Z",
    "human_id": "dennis",
    "agent_id": "limen-agent",
    "session_id": "bootstrap",
    "snapshot_checksum": "db05604a60fc0d2691f5bf82f9549e05910d388a7a81d306424a0802a3b237a0"
  }
}
